In [4]:
import mysql.connector

try:
    conn = mysql.connector.connect(host='localhost',user='root',port=3307,password='inix2025')
    print("Connected")
except:
    print("Connection failed")
#conn.close()
cursor = conn.cursor()

Connected

In [72]:
# Check connection status
if conn.is_connected():
    print("Connection is open")
else:
    print("Connection is closed")

Connection is open

In [73]:
cursor.execute("select version()")
print(cursor.fetchone()[0])

8.0.43

In [15]:
import pandas as pd
def tampil_data():
    rows = cursor.fetchall()
    columns = [col[0] for col in cursor.description]

    df = pd.DataFrame(rows, columns=columns)
    pd.set_option('display.max_columns', None)
    return df

In [16]:
cursor.execute("select user, Host from mysql.user")
tampil_data()

               user       Host
0             sapto          %
1              badu  localhost
2  mysql.infoschema  localhost
3     mysql.session  localhost
4         mysql.sys  localhost
5              root  localhost
6          tanpa_pw  localhost

In [17]:
cursor.execute("select user()")
tampil_data()

           user()
0  root@localhost

In [21]:
cursor.execute("show databases")
tampil_data()

             Database
0  information_schema
1   inixindo_surabaya
2               mysql
3  performance_schema
4                 sys

In [23]:
cursor.execute("select database()")
tampil_data()

  database()
0       None

## Belum ada schema/db yang terpilih. (Set default schema in workbench)

In [74]:
cursor.execute("use inixindo_surabaya")

In [75]:
cursor.execute("select database()")
tampil_data()

          database()
0  inixindo_surabaya

## Setelah use inixindo_surabaya, maka default schema menjadi **inixindo_surabaya**

---
---

In [27]:
cursor.execute("create table inventory (inventory_id INT, item_name VARCHAR(50), number_in_stock INT)")

In [45]:
cursor.execute("show tables")
tampil_data()

  Tables_in_inixindo_surabaya
0           course_enrollment
1                     courses
2               datatype_demo
3           inixindo_employee
4                   inventory

In [62]:
cursor.execute("describe inventory")
tampil_data()

             Field         Type Null Key Default Extra
0     inventory_id          int  YES        None
1        item_name  varchar(50)  YES        None
2  number_in_stock          int  YES        None

## INSERT using multirow format

In [47]:
cursor.execute("""
INSERT INTO inventory (inventory_id, item_name, number_in_stock) VALUES
    (1, 'Keyboard', 25),
    (2, 'Mouse', 40),
    (3, 'Monitor', 15),
    (4, 'USB Cable', 100),
    (5, 'Headset', 20),
    (6, 'Laptop Stand', 10),
    (7, 'Webcam', 12),
    (8, 'Charger', 35),
    (9, 'SSD 512GB', 18),
    (10, 'Router', 8)
""")
conn.commit()

In [48]:
cursor.execute("select * from inventory")
tampil_data()

   inventory_id     item_name  number_in_stock
0             1      Keyboard               25
1             2         Mouse               40
2             3       Monitor               15
3             4     USB Cable              100
4             5       Headset               20
5             6  Laptop Stand               10
6             7        Webcam               12
7             8       Charger               35
8             9     SSD 512GB               18
9            10        Router                8

## INSERT using batch insert

In [49]:
data = [
    (11, 'Microcontroller', 25),
    (12, 'CCTV', 40),
    (13, 'SSD 1000GB', 15)
]

cursor.executemany("INSERT INTO inventory (inventory_id, item_name, number_in_stock) VALUES (%s, %s, %s)", data)
conn.commit()

In [60]:
cursor.execute("select * from inventory")
tampil_data()

    inventory_id        item_name  number_in_stock
0              1         Keyboard               25
1              2            Mouse               40
2              3          Monitor               15
3              4        USB Cable              100
4              5          Headset               20
5              6     Laptop Stand               10
6              7           Webcam               12
7              8          Charger               35
8              9        SSD 512GB               18
9             10           Router                8
10            11  Microcontroller               25
11            12             CCTV               40
12            13       SSD 1000GB               15

In [76]:
cursor.execute("ALTER TABLE inventory MODIFY COLUMN inventory_id INT NOT NULL")

hallo